emacs/elpy/python_goto_define.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>python_goto_define</title>
<!-- 2017-01-11 Wed 21:20 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
</head>
<body>
<div id="content">
<h1 class="title">python_goto_define</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. python 跳到代碼定義處</a>
<ul>
<li><a href="#sec-1-1">1.1. summary</a></li>
<li><a href="#sec-1-2">1.2. code</a>
<ul>
<li><a href="#sec-1-2-1">1.2.1. <span class="underline"><span class="underline">main</span></span>.py</a></li>
<li><a href="#sec-1-2-2">1.2.2. sub.py</a></li>
<li><a href="#sec-1-2-3">1.2.3. sub2.py</a></li>
</ul>
</li>
<li><a href="#sec-1-3">1.3. analysis</a></li>
<li><a href="#sec-1-4">1.4. Reflection</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> python 跳到代碼定義處</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> summary</h3>
<div class="outline-text-3" id="text-1-1">
<p>
這裏使用的插件是elpy，代碼跳轉使用的是jedi
問題：No definition found
代碼結構:
</p>
<div class="org-src-container">

<pre class="src src-shell">╰─➤  tree elpy_q 
elpy_q
├── __init__.py
├── __main__.py
├── sub
│   ├── __init__.py
│   └── sub.py
└── sub2
    ├── __init__.py
    └── sub2.py

2 directories, 6 files
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> code</h3>
<div class="outline-text-3" id="text-1-2">
</div><div id="outline-container-sec-1-2-1" class="outline-4">
<h4 id="sec-1-2-1"><span class="section-number-4">1.2.1</span> <span class="underline"><span class="underline">main</span></span>.py</h4>
<div class="outline-text-4" id="text-1-2-1">
<div class="org-src-container">

<pre class="src src-python">1│from sub2.sub2 import test2
2│
3│
4│test2()
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-1-2-2" class="outline-4">
<h4 id="sec-1-2-2"><span class="section-number-4">1.2.2</span> sub.py</h4>
<div class="outline-text-4" id="text-1-2-2">
<div class="org-src-container">

<pre class="src src-python">1│import os
2│
3│
4│def test():
5│    print('sub: ' + os.getcwd())
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-1-2-3" class="outline-4">
<h4 id="sec-1-2-3"><span class="section-number-4">1.2.3</span> sub2.py</h4>
<div class="outline-text-4" id="text-1-2-3">
<div class="org-src-container">

<pre class="src src-python">1│from sub.sub import test
2│
3│
4│def test2():
5│    print('sub2 call sub')
6│    test()
</pre>
</div>
<p>
在文件sub2中跳轉到test位置,提示:
No definition found .
但是呢，sub1中明明是有的。
</p>
</div>
</div>
</div>
<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> analysis</h3>
<div class="outline-text-3" id="text-1-3">
<div class="org-src-container">

<pre class="src src-elisp">1707│(defun elpy-goto-definition ()
1708│  "Go to the definition of the symbol at point, if found."
1709│  (interactive)
1710│  (let ((location (elpy-rpc-get-definition)))
1711│    (if location
1712│        (elpy-goto-location (car location) (cadr location))
1713│      (error "No definition found"))))
</pre>
</div>
<div class="org-src-container">

<pre class="src src-elisp">2721│(defun elpy-rpc--get-rpc-buffer ()                                                                                                              
2722│  "Return the RPC buffer associated with the current buffer,                                                                                    
2723│creating one if necessary."                                                                                                                     
2724│  (when (not (elpy-rpc--process-buffer-p elpy-rpc--buffer))                                                                                     
2725│    (setq elpy-rpc--buffer                                                                                                                      
2726│          (or (elpy-rpc--find-buffer (elpy-library-root)                                                                                        
2727│                                     elpy-rpc-python-command)                                                                                   
2728│              (elpy-rpc--open (elpy-library-root)                                                                                               
2729│                              elpy-rpc-python-command))))
</pre>
</div>
<div class="org-src-container">

<pre class="src src-elisp">1226│(defun elpy-library-root ()                                                                                                                     
1227│  "Return the root of the Python package chain of the current buffer.                                                                           
1228│                                                                                                                                                
1229│That is, if you have /foo/package/module.py, it will return /foo,                                                                               
1230│so that import package.module will pick up module.py."                                                                                          
1231│  (locate-dominating-file default-directory                                                                                                     
1232│                          (lambda (dir)                                                                                                         
1233│                            (not (file-exists-p                                                                                                 
1234│                                  (format "%s/__init__.py"                                                                                      
1235│                                          dir))))))
</pre>
</div>
<p>
最後終於找到了elpy-library-root這個函數。
代碼都快讀完了都沒有發現啥問題,不知道讀到這裏的聰明的你有沒有看出啥來。
</p>
<div class="org-src-container">

<pre class="src src-python">27│    def __init__(self, project_root):                                                                                                           
28│        self.project_root = project_root
29│        self.completions = {}                                                                                                                   
30│        sys.path.append(project_root)
</pre>
</div>
<p>
甚至在這裏把項目的路徑根都保存出來啦。
發現一個問題，出現的這個路徑是有問題的，總是我項目的父路徑，爲什麼呢？
</p>
<div class="org-src-container">

<pre class="src src-elisp">27│    def __init__(self, project_root):                                                                                                           
28│        self.project_root = project_root
29│        self.completions = {}                                                                                                                   
30│        sys.path.append(project_root)
</pre>
</div>
<p>
甚至在這裏把項目的路徑根都保存出來啦。
發現一個問題，出現的這個路徑是有問題的，總是我項目的父路徑，爲什麼呢？
重點來了。
</p>
<div class="org-src-container">

<pre class="src src-elisp">(locate-dominating-file default-directory
			  (lambda (dir)
			    (not (file-exists-p
				  (format "%s/__init__.py"
					  dir))))))
</pre>
</div>
<p>
這個方法是用來幹嘛的？看半天沒看明白，後來才明白，是根據第二個參數向上級目錄遍歷，
直到找到滿足條件的目錄，然後把他的父目錄返回，就是我項目的父目錄。
我們看到這個匿名函數是幹嘛的？
是檢查該目錄下有沒有"<span class="underline"><span class="underline">init</span></span>.py"文件，思考一下，作者爲啥這麼寫呢。
其實想想也挺簡單的，檢查這是不是一個包嘛，如果是包，就默認去找上級沒有"<span class="underline"><span class="underline">init</span></span>.py".
</p>
</div>
</div>
<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> Reflection</h3>
<div class="outline-text-3" id="text-1-4">
<p>
代碼不規範，主函數怎麼能定義在包裏呢？
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2017-01-11 Wed 21:20</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.1.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
<!-- 多说评论框 start -->
<div class="ds-thread" data-thread-key="6" data-title="python goto define" data-url="http://blog.flytrap.top/emacs/elpy/python_goto_define.html"></div>
<!-- 多说评论框 end -->
<!-- 多说公共JS代码 start (一个网页只需插入一次) -->
<script type="text/javascript">
var duoshuoQuery = {short_name:"flytrap"};
	(function() {
		var ds = document.createElement('script');
		ds.type = 'text/javascript';ds.async = true;
		ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
		ds.charset = 'UTF-8';
		(document.getElementsByTagName('head')[0] 
		 || document.getElementsByTagName('body')[0]).appendChild(ds);
	})();
	</script>
<!-- 多说公共JS代码 end -->
</html>
